; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_5_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 - counter
	)
  (:init
		(= (value c0) 76)
	(= (value c1) 22)
	(= (value c2) 88)
	(= (value c3) 14)
	(= (value c4) 25)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 2 of 4
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 2 of 4
3. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 2 of 4
4. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 2 of 4
5. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 2 of 4
6. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 2 of 4
7. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 2 of 4
8. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 2 of 4
9. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 2 of 4
10. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 2 of 4
11. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 2 of 4
12. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 2 of 4
13. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 2 of 4
14. (increment c3)
   changed: (value c3) from 14 to 21
   goals met: 2 of 4
15. (increment c3)
   changed: (value c3) from 21 to 28
   goals met: 1 of 4
16. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 1 of 4
17. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 1 of 4
18. (decrement c3)
   changed: (value c3) from 28 to 19
   goals met: 2 of 4
19. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 2 of 4
20. (increment c3)
   changed: (value c3) from 19 to 29
   goals met: 1 of 4
21. (increment c3)
   changed: (value c3) from 29 to 39
   goals met: 1 of 4
22. (increment c3)
   changed: (value c3) from 39 to 49
   goals met: 1 of 4
23. (increment c3)
   changed: (value c3) from 49 to 59
   goals met: 1 of 4
24. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 1 of 4
25. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 1 of 4
26. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 1 of 4
27. (increment c3)
   changed: (value c3) from 59 to 69
   goals met: 1 of 4
28. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 1 of 4
29. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 1 of 4
30. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 1 of 4
31. (increment c1)
   changed: (value c1) from 22 to 30
   goals met: 1 of 4
32. (increment c1)
   changed: (value c1) from 30 to 38
   goals met: 1 of 4
33. (increment c1)
   changed: (value c1) from 38 to 46
   goals met: 1 of 4
34. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 1 of 4
35. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 1 of 4
36. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 1 of 4
37. (increment c1)
   changed: (value c1) from 46 to 55
   goals met: 1 of 4
38. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 1 of 4
39. (increment c1)
   changed: (value c1) from 55 to 65
   goals met: 1 of 4
40. (increment c1)
   changed: (value c1) from 65 to 75
   goals met: 1 of 4
41. (increment c1)
   changed: (value c1) from 75 to 85
   goals met: 2 of 4
42. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 2 of 4
43. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 2 of 4
44. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 2 of 4
45. (increment c3)
   changed: (value c3) from 69 to 79
   goals met: 2 of 4
46. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 2 of 4
47. (increment c4)
   changed: (value c4) from 25 to 33
   goals met: 2 of 4
48. (decrement c3)
   changed: (value c3) from 79 to 69
   goals met: 2 of 4
49. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 2 of 4
50. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 2 of 4
51. (increment c4)
   changed: (value c4) from 33 to 43
   goals met: 2 of 4
52. (increment c4)
   changed: (value c4) from 43 to 53
   goals met: 2 of 4
53. (increment c3)
   changed: (value c3) from 69 to 79
   goals met: 2 of 4
54. (increment c4)
   changed: (value c4) from 53 to 63
   goals met: 2 of 4
55. (increment c4)
   changed: (value c4) from 63 to 73
   goals met: 2 of 4
56. (increment c4)
   changed: (value c4) from 73 to 83
   goals met: 3 of 4
57. (increment c3)
   changed: (value c3) from 79 to 89
   goals met: 3 of 4
58. (increment c4)
   changed: (value c4) from 83 to 93
   goals met: 4 of 4
